#!/usr/bin/python

# -*- coding:utf-8 -*-
 #============== python 中的数值类型 =============================================

 #============== 整型和长整型 =============================================
 # 十六进制表达整型
a = 0xFF
print("a = "+str(a))
# 八进制表达整型
b = 0o10
print("b = "+ str(b))

c = 2462436147273461413471363147171437
print("c = "+str(c))
# 布尔型
print(bool(None))
print(bool(1))

print(bool(0))

print(bool(0.00))

print(bool(True))

print(bool(False))

print(bool("true"))

print(bool(''))

print(bool('false'))

print(bool([]))

print(bool((1,)))



# ==================关于 布尔值 bool() 总结 ==========================;
# 特性：整型的子类型，布尔型数据只取 True和False，分别对应整型的 1和0;
# 测试可知以下场景的布尔值为 False,其他为 True。它们分别是：
#       None; 0 (整形); Flae(布尔型); 0.0(浮点型); 0.0+0.0j(复数);
#       ''/""(空字符); [](空列表); ()(空元组); {}(空字典/空集合);
# ===================================================================;
foo = 2333
bar = foo < 2333
print(bar)
print(bar + foo)
print("%s" %bar)
print("%d" %bar)
#===================================================================================
#============================= 浮点型 ==============================================
print(6.666666)
print(-3.1415926)
print(43e2 * 0.5)
print(23.11e-18)
#===================================================================================
#============================= 复数 ==============================================

print(complex(2,8))
print(2333 + 100j)

#===================================================================================
#============================= 十进制浮点型 ==============================================

# 使用十进制浮点型要先引入 decimal 模块
from decimal import * 

dec = Decimal('.3')

print(dec)
print(Decimal(.1))

print(dec + Decimal(.1))

#===================================================================================
#============================= 数值类型的转换  ==============================================

print(int(3.1415926535897))
print(float(99))
print(complex(7))

#===================================================================================
#============================= 进制的转换  ==============================================
print(hex(1024))
print(oct(1024))
print(oct(0xFFFF))
#===================================================================================
#============================= ASII的转换  ==============================================
print(chr(33))
print(ord('#'))
#===================================================================================
#============================= 函数扩展  ==============================================

# 数学函数 需要引入 math 模块 数学常量 pi（圆周率） e (自然常数)
from math import * 
# ceil(x) 该函数返回数字的上入整数
print(ceil(4.2))

# floor(x) 该函数返回数字的下舍整数
print(floor(4.9))

# fabs(x) 该函数返回数字的绝对值
print(fabs(-23))

# factorial(x) 该函数返回数字的阶乘
print(factorial(5))

# hypot(x,y) 该函数返回欧几里得范数 sqrt(x*x+y*y) 勾三股四弦五
print(hypot(3,4))

# sqrt(x) 该函数返回数字的平方根
print(sqrt(25))

# pow(x,y) 该函数返回x的y次方 x**y
print(pow(2, 10))

# log(x,y) 该函数返回以y为基数的x的对数
print(log(25,5))

# log10(x) 该函数返回以10为基数的x的对数
print(log10(1000))

# trunc(x) 该函数返回数字的整数部分
print(trunc(2.333333))

# isnan(x) 判断对象或集合是否为空
# 创建一个对象 
c = float('nan')
b = bool(nan)
print(isnan(c))
print(isnan(b))

class Zero:pass
c = Zero
print(str(bool(c)))

# degrees(x) 将弧度转换成角度  
print(degrees(pi/4))

# radians(x) 将角度转换为弧度
print(radians(60))

#===================================================================================
#=============================  作业中用到的其他函数  ==============================================

# str() 该函数将给定参数转成可阅读的字符
# bool() 该函数将给定参数转成布尔类型
