#!/usr/bin/python

# ==================================== 条件控制与循环 ==========================================

#========= IF.....ELSE ========================================


num = int(input('猜数字：'))

if num < 10:
    print("你输入的数字太小了，沙雕")
elif num == 10:
    print("虽然你猜对了，但你还是个沙雕")
else:
    print("这个数字有点大，沙雕")


#===================== while 循环 ==================================================

lists = []

count = 0
while(count <5):
    lists.append(input('lists添加元素：'))
    if 'y' in lists:
        break
    count = count + 1

print(lists)

#========================================================================================

#===================== for 循环 ==========================================================

count = 0
for word in lists:
    print('item=='+word)

# 迭代过程中修改迭代序列是不安全的，可使用切片复制
for word in lists[:]:
    if len(word) > 0:
        lists.insert(0,word)
    else:
        lists.pop()

print(lists)

#==========================================================================================

#====================== range() 函数 ======================================================
# 函数说明：该函数可生成一个等差数列
# range(x) 生成一个长度为x得等差数列
# range(x,y) 生成一个步长为y的长度为x的等差数列,步长可以为负数
# range(x,y,z) 生成一个以x开头的z结尾的长度为x的等差数列，步长可以为负数

# range()函数的使用：

for i in range(len(lists)):
    print('第%d个元素是%s' %(i, lists[i]))

# xrange 和 range 的区别
# xrange 效率比range高，因为xrange不生成完整的列表
# xrange 只在for循环中使用才有意义
#===========================================================================================

#=============== 循环终止语句==========================================================================

# break 跳出循环，执行下一段代码

# 代码参考 while循环

# continue 跳出当前循环，继续下一次循环

for item in lists:
    if item == 'a':
        continue 
    print(item)

# pass 空语句占位符，用于保持结构完整性

for item in lists:
    if item == 'a':
        pass
        print('这个家伙叫pass')
    else:
        print(item)

#======================================================================================================

#======================== 温故知新 ===============================================================

# 乘法口诀表

x = y = 1
s = ''
for x in range(1,10):
    for y in range(1,x+1):
        s = s+ str(y)+' * '+str(x)+'='+str(x*y)+"  "
    s = s + '\n'
print(s)